# Chapter 7

In [8]:
import pandas as pd
import numpy as np

In [9]:
import matplotlib.pyplot as plt

In [5]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0]= None

In [9]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [10]:
from numpy import nan as NA

In [11]:
data = pd.Series([1,NA,3.5,NA, 7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA, NA],
                   [NA, NA, NA], [NA, 6.5,3.]])

In [15]:
cleaned = data.dropna()

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how= 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4]=NA

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis=1, how ='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df = pd.DataFrame(np.random.randn(7, 3))

In [23]:
df.iloc[:4, 1]= NA

In [24]:
df.iloc[:2,2]= NA

In [25]:
df

          0         1         2
0 -0.029414       NaN       NaN
1  1.751899       NaN       NaN
2 -0.355170       NaN  0.512755
3 -0.128092       NaN  1.187254
4 -0.324000  1.134526 -0.308248
5  1.345857 -0.852863  0.678220
6 -1.217356  0.496562  0.985299

In [26]:
df.dropna()

          0         1         2
4 -0.324000  1.134526 -0.308248
5  1.345857 -0.852863  0.678220
6 -1.217356  0.496562  0.985299

In [27]:
df.dropna(thresh=2)

          0         1         2
2 -0.355170       NaN  0.512755
3 -0.128092       NaN  1.187254
4 -0.324000  1.134526 -0.308248
5  1.345857 -0.852863  0.678220
6 -1.217356  0.496562  0.985299

In [28]:
df.fillna(0)

          0         1         2
0 -0.029414  0.000000  0.000000
1  1.751899  0.000000  0.000000
2 -0.355170  0.000000  0.512755
3 -0.128092  0.000000  1.187254
4 -0.324000  1.134526 -0.308248
5  1.345857 -0.852863  0.678220
6 -1.217356  0.496562  0.985299

In [29]:
df.fillna({1:0.5, 2:0})

          0         1         2
0 -0.029414  0.500000  0.000000
1  1.751899  0.500000  0.000000
2 -0.355170  0.500000  0.512755
3 -0.128092  0.500000  1.187254
4 -0.324000  1.134526 -0.308248
5  1.345857 -0.852863  0.678220
6 -1.217356  0.496562  0.985299

In [30]:
_= df.fillna(0, inplace=True)

In [31]:
df

          0         1         2
0 -0.029414  0.000000  0.000000
1  1.751899  0.000000  0.000000
2 -0.355170  0.000000  0.512755
3 -0.128092  0.000000  1.187254
4 -0.324000  1.134526 -0.308248
5  1.345857 -0.852863  0.678220
6 -1.217356  0.496562  0.985299

In [32]:
df = pd.DataFrame(np.random.randn(6, 3))

In [33]:
df.iloc[2:, 1]= NA

In [34]:
df.iloc[4:,2]=NA

In [35]:
df

          0         1         2
0  0.616510  0.979914  0.891482
1 -1.373035 -0.219026 -0.660290
2 -0.767453       NaN  0.432334
3 -0.448453       NaN -0.160831
4 -0.179741       NaN       NaN
5 -0.897611       NaN       NaN

In [36]:
df.fillna(method='ffill')

          0         1         2
0  0.616510  0.979914  0.891482
1 -1.373035 -0.219026 -0.660290
2 -0.767453 -0.219026  0.432334
3 -0.448453 -0.219026 -0.160831
4 -0.179741 -0.219026 -0.160831
5 -0.897611 -0.219026 -0.160831

In [37]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.616510  0.979914  0.891482
1 -1.373035 -0.219026 -0.660290
2 -0.767453 -0.219026  0.432334
3 -0.448453 -0.219026 -0.160831
4 -0.179741       NaN -0.160831
5 -0.897611       NaN -0.160831

In [38]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [39]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [45]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [46]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [47]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [48]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [49]:
data['v1']= range(7)

In [50]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [51]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [52]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon', 'Pastrami','corned beef', 'Bacon', 'pastrami','honey ham','nova lox'], 'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [53]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [54]:
meat_to_animal = {'bacon':'pig','pulled pork':'pig','pastrami':'cow','corned beef':'cow','honey ham':'pig','nova lox': 'salmon'}

In [55]:
lowercased = data ['food'].str.lower()

In [56]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [57]:
data['animal']= lowercased.map(meat_to_animal)

In [58]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [59]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [61]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [62]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [63]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [65]:
data.replace([-999,-1000], [np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [66]:
data.replace({-999: np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [67]:
data = pd.DataFrame(np.arange(12).reshape((3,4)), index =['Ohio','Colorado','New York'], columns=['one','two','three','four'])

In [68]:
transform = lambda x: x[:4].upper()

In [69]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [70]:
data.index = data.index.map(transform)

In [71]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [72]:
data.rename(index={'OHIO': 'INDIANA'}, columns ={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [73]:
data.rename(index ={'OHIO':'INDIANA'},inplace=True)

In [74]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [75]:
ages =[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [76]:
bins = [18,25,35,60,100]

In [77]:
cats= pd.cut(ages, bins)

In [78]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [79]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [80]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [81]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [92]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

group_names = ['Youth','YoungAdult','MiddleAged','Senior']

In [95]:
pd.cut(ages, bins, labels= group_names)

NameError: name 'group_names' is not defined

In [96]:
data = np.random.rand(20)

In [97]:
pd.cut(data, 4, precision =2)

[(0.75, 1.0], (0.5, 0.75], (0.26, 0.5], (0.26, 0.5], (0.01, 0.26], ..., (0.01, 0.26], (0.5, 0.75], (0.01, 0.26], (0.5, 0.75], (0.01, 0.26]]
Length: 20
Categories (4, interval[float64, right]): [(0.01, 0.26] < (0.26, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

In [98]:
data = np.random.randn(1000)

In [99]:
cats =pd.qcut(data,4) #cuts into quartiles

In [100]:
cats

[(0.675, 2.996], (-0.668, 0.0204], (-0.668, 0.0204], (-3.195, -0.668], (-0.668, 0.0204], ..., (0.675, 2.996], (-3.195, -0.668], (0.675, 2.996], (-0.668, 0.0204], (0.0204, 0.675]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.195, -0.668] < (-0.668, 0.0204] < (0.0204, 0.675] < (0.675, 2.996]]

In [101]:
pd.value_counts(cats)

(-3.195, -0.668]    250
(-0.668, 0.0204]    250
(0.0204, 0.675]     250
(0.675, 2.996]      250
dtype: int64

In [102]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(0.0204, 1.286], (-1.327, 0.0204], (-1.327, 0.0204], (-1.327, 0.0204], (-1.327, 0.0204], ..., (0.0204, 1.286], (-1.327, 0.0204], (1.286, 2.996], (-1.327, 0.0204], (0.0204, 1.286]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.195, -1.327] < (-1.327, 0.0204] < (0.0204, 1.286] < (1.286, 2.996]]

In [103]:
data= pd.DataFrame(np.random.randn(1000,4))

In [104]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.001060     0.054335     0.014052     0.007197
std       0.991047     1.030503     1.014025     1.040921
min      -3.017592    -3.646996    -2.640375    -3.444646
25%      -0.647985    -0.652836    -0.653994    -0.670745
50%       0.008216     0.077370     0.003802     0.006004
75%       0.651216     0.752195     0.678959     0.679636
max       3.000451     3.770203     2.794426     3.151949

In [105]:
col = data[2]

In [106]:
col[np.abs(col)>3]

Series([], Name: 2, dtype: float64)

In [107]:
data[(np.abs(data)> 3).any(1)]

            0         1         2         3
141  0.237419  0.196520 -1.515328  3.011308
275 -1.489842  3.770203 -1.390153  0.699300
286 -1.145602  0.860585 -0.216959  3.140820
404 -0.231707  0.938461  0.763455 -3.006606
474  1.336563 -1.041149  1.252605 -3.444646
652 -1.511716 -3.646996 -1.396996  0.676688
783  3.000451 -0.643911  0.244400 -0.666530
824 -3.017592 -0.645110 -1.012465  0.442319
941  0.738674 -2.593620  1.903731  3.151949

In [108]:
data[np.abs(data) > 3]= np.sign(data)*3

In [109]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.001077     0.054212     0.014052     0.007344
std       0.990992     1.025878     1.014025     1.038622
min      -3.000000    -3.000000    -2.640375    -3.000000
25%      -0.647985    -0.652836    -0.653994    -0.670745
50%       0.008216     0.077370     0.003802     0.006004
75%       0.651216     0.752195     0.678959     0.679636
max       3.000000     3.000000     2.794426     3.000000

In [110]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1  1.0 -1.0 -1.0 -1.0
2 -1.0  1.0  1.0 -1.0
3  1.0 -1.0  1.0  1.0
4 -1.0 -1.0 -1.0  1.0

In [111]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [113]:
sampler= np.random.permutation(5)

In [114]:
sampler

array([4, 0, 1, 3, 2])

In [115]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [116]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11

In [117]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3

In [118]:
choices = pd.Series([5,7,-1,6,4])

In [119]:
draws = choices.sample(n=10, replace =True)

In [120]:
draws

1    7
4    4
4    4
0    5
4    4
0    5
2   -1
1    7
0    5
1    7
dtype: int64

In [122]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})

In [123]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [124]:
dummies = pd.get_dummies(df['key'],prefix='key')

In [125]:
df_with_dummy =df[['data1']].join(dummies)

In [126]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [127]:
mnames=['movie_id','title','genres']

In [129]:
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)

/var/folders/1s/yqryqhms0kz8vy_c_806zj7w0000gp/T/ipykernel_1133/1850641219.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('datasets/movielens/movies.dat', sep='::',

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

In [130]:
movies[:10]

NameError: name 'movies' is not defined

In [131]:
all_genres = []

In [132]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

NameError: name 'movies' is not defined

In [133]:
genres = pd.unique(all_genres)

In [134]:
genres

array([], dtype=float64)

In [135]:
zero_matrix = np.zeros((len(movies), len(genres)))

NameError: name 'movies' is not defined

In [136]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

NameError: name 'zero_matrix' is not defined

In [1]:
gen = movies.genres[0]

NameError: name 'movies' is not defined

In [2]:
gen.split('|')

NameError: name 'gen' is not defined

In [3]:
dummies.columns.get_indexer(gen.split('|'))

NameError: name 'dummies' is not defined

In [4]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

NameError: name 'movies' is not defined

In [5]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

NameError: name 'movies' is not defined

In [6]:
movies_windic.iloc[0]

NameError: name 'movies_windic' is not defined

In [10]:
np.random.seed(12345)

In [11]:
values = np.random.rand(10)

In [12]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [13]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [15]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [16]:
val = 'a,b, guido'

In [17]:
val.split(',')

['a', 'b', ' guido']

In [18]:
pieces = [x.strip() for x in val.split(',')]

In [19]:
pieces

['a', 'b', 'guido']

In [20]:
first,second,third =pieces

In [22]:
first + '::'+ second +'::' +third

'a::b::guido'

In [23]:
'::'.join(pieces)

'a::b::guido'

In [24]:
'guido' in val

True

In [25]:
val.index(',')

1

In [26]:
val.find(':')

-1

In [28]:
val.index(':')

ValueError: substring not found

In [29]:
val.count(',')

2

In [30]:
val.replace(',','::')

'a::b:: guido'

In [31]:
val.replace(',','')

'ab guido'

In [32]:
import re

In [33]:
text ="foo bar\t baz  \tqux"

In [34]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [36]:
regex = re.compile('\s+')

In [37]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [38]:
regex.findall(text)

[' ', '\t ', '  \t']

In [39]:
text = """Dave dave@google.com Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [40]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [41]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [42]:
m = regex.search(text)

In [43]:
m

In [44]:
text[m.start():m.end()]

'dave@google.com'

In [45]:
print(regex.match(text))

None

In [46]:
print(regex.sub('REDACTED',text))

Dave REDACTED Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [48]:
pattern= r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [49]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [50]:
m = regex.match('wesm@bright.net')

In [51]:
m.groups()

('wesm', 'bright', 'net')

In [52]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [53]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [54]:
data= {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob':'rob@gmail.com','Wes': np.nan}

In [55]:
data =pd.Series(data)

In [56]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [57]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [58]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [59]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [60]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [61]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [62]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [64]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!